{
  "day": 3,
  "title": "Integration – Building Ordered Sentences with Prepositions (Accusative)",
  "estimated_duration": "12–15 minutes",
  "goals": [
    "Use prepositional phrases with verbs of motion to form complete Latin sentences",
    "Translate sentences showing direction and order",
    "Recognize how grammar creates meaning and order",
    "Connect linguistic order to the virtue Ordō – Order"
  ],
  "steps": [
    {
      "time_estimate": "00:00–00:01",
      "speak": "Salve! Welcome to Week 14 Day 3. Today we’ll put everything together — motion, endings, and direction.",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:01–00:02",
      "speak": "Let’s recall our prepositions: ad, in, per, super, ante. They all use the accusative when showing motion toward.",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:02–00:03",
      "speak": "Now, listen and act out each sentence: Puella currit ad domum – The girl runs to the house.",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:03–00:04",
      "speak": "Puer portat aquam per viam – The boy carries water through the road.",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:04–00:05",
      "speak": "Agricola ambulat in agrum – The farmer walks into the field.",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:05–00:06",
      "speak": "Dominus stetit ante domum – The master stood before the house.",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:06–00:07",
      "speak": "Mini quiz: What do all these nouns have in common at the end?",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:07–00:08",
      "speak": "Correct! They all end in –am or –um — the accusative form, showing motion toward.",
      "pause_for_response": false
    },
    {
      "time_estimate": "00:08–00:09",
      "speak": "Let’s build our own sentence together. Think: Who? What action? Toward what?",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:09–00:10",
      "speak": "Try saying: Discipulus ambulat ad scholam – The student walks to school.",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:10–00:11",
      "speak": "Faith phrase: Ad Dominum currimus – We run to the Lord. What does this show about direction and purpose?",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:11–00:12",
      "speak": "Virtue reflection: God’s order helps us know where to go and what to do, just as Latin endings show direction.",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:12–00:13",
      "speak": "Excellent! Tomorrow we’ll master these ideas with review and chant.",
      "pause_for_response": false
    }
  ]
}