{
  "metadata": {
    "week": 1,
    "day": 4,
    "title": "Week 1 Day 4: Latin Alphabet and Basic Vocabulary",
    "duration_minutes": 45,
    "virtue": "Discipline",
    "faith_phrase": "In principio - In the beginning"
  },
  "prior_knowledge_digest": "Students should have a basic understanding of the Latin alphabet and its pronunciation. They should be familiar with the concept of discipline as a virtue and its application in learning. Students have been introduced to the faith phrase 'In principio' and its significance in the context of beginnings. Basic vocabulary such as 'amicus', 'familia', and 'terra' have been introduced, focusing on pronunciation and simple usage in phrases.",
  "yesterday_recap": "Yesterday, students practiced the Latin alphabet through chants and learned new vocabulary words including 'aqua', 'luna', and 'sol'. They also explored the virtue of discipline in their study habits.",
  "spiral_links": {
    "recycled_vocab": [
      "amicus",
      "familia",
      "terra"
    ],
    "recycled_grammar": [
      "noun usage",
      "simple phrases"
    ],
    "prior_day_concepts": [
      "Latin alphabet",
      "discipline"
    ],
    "prior_weeks": []
  },
  "misconception_watchlist": [
    "Confusing pronunciation of 'c' and 'g'",
    "Mixing up noun endings"
  ],
  "objectives": {
    "primary": [
      "Students will recognize and pronounce the Latin alphabet.",
      "Students will learn and use basic Latin vocabulary in context.",
      "Students will connect the virtue of discipline with their study habits."
    ],
    "spiral_review": [
      "Review pronunciation of previously learned vocabulary.",
      "Reinforce understanding of the faith phrase 'In principio'."
    ]
  },
  "materials": [
    "Alphabet chart",
    "Vocabulary flashcards",
    "Chant audio",
    "Faith phrase poster"
  ],
  "lesson_flow": [
    {
      "type": "recall",
      "duration_minutes": 10,
      "description": "Review the Latin alphabet and previously learned vocabulary using flashcards.",
      "student_action": "Students will recite the alphabet and vocabulary words aloud.",
      "teacher_notes": "Focus on correct pronunciation and encourage participation."
    },
    {
      "type": "review",
      "duration_minutes": 5,
      "description": "Discuss the faith phrase 'In principio' and its importance.",
      "student_action": "Students will repeat the phrase and discuss its meaning.",
      "teacher_notes": "Connect the phrase to the concept of beginnings and discipline."
    },
    {
      "type": "guided_practice",
      "duration_minutes": 10,
      "description": "Introduce new vocabulary words and practice pronunciation.",
      "student_action": "Students will listen and repeat new words, using them in simple phrases.",
      "teacher_notes": "Use visual aids and examples to enhance understanding."
    },
    {
      "type": "independent_practice",
      "duration_minutes": 10,
      "description": "Students will create simple sentences using new and reviewed vocabulary.",
      "student_action": "Students will write and share their sentences with the class.",
      "teacher_notes": "Provide feedback on sentence structure and vocabulary usage."
    },
    {
      "type": "closure",
      "duration_minutes": 5,
      "description": "Reflect on the virtue of discipline and its role in learning Latin.",
      "student_action": "Students will share how they applied discipline in today's lesson.",
      "teacher_notes": "Encourage students to set personal goals for improvement."
    },
    {
      "type": "assessment",
      "duration_minutes": 5,
      "description": "Quick oral quiz on vocabulary and alphabet pronunciation.",
      "student_action": "Students will answer questions and demonstrate their knowledge.",
      "teacher_notes": "Use this to gauge understanding and identify areas needing review."
    }
  ],
  "behavior": {
    "tone": "Encouraging and supportive",
    "loop_behavior": "Repeat instructions with varied examples if needed",
    "hints_max": 3,
    "wait_seconds": 5,
    "encouragement_frequency": "Frequent"
  }
}
