{
  "day": 2,
  "title": "Practice – Using Prepositions with the Ablative (Rest & Relationship)",
  "estimated_duration": "12–15 minutes",
  "goals": [
    "Chant and translate Ablative prepositional phrases",
    "Compare with Accusative motion phrases for contrast",
    "Use verbs of rest (est, sedet, manet, habitat)",
    "Reflect on peace as right placement – Pax"
  ],
  "steps": [
    {
      "time_estimate": "00:00–00:01",
      "speak": "Salve! Welcome to Week 15 Day 2. Today we’ll rest in the grammar we discovered yesterday!",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:01–00:02",
      "speak": "Chant with me: in hortō (in the garden), sub arbore (under the tree), cum amīcō (with a friend), ē templō (out of the temple), dē monte (down from the mountain).",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:02–00:03",
      "speak": "Notice the endings –ā, –ō. These show rest and relationship — no motion!",
      "pause_for_response": false
    },
    {
      "time_estimate": "00:03–00:04",
      "speak": "Act it out! Sit quietly as you say in hortō. Raise your hand gently for sub arbore. Join hands for cum amīcō.",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:04–00:05",
      "speak": "Now compare: in hortō (in the garden) vs. in hortum (into the garden). Which one moves?",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:05–00:06",
      "speak": "Correct — in hortum moves (Accusative); in hortō rests (Ablative).",
      "pause_for_response": false
    },
    {
      "time_estimate": "00:06–00:07",
      "speak": "Say and translate together: Puella sedet in hortō – The girl sits in the garden.",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:07–00:08",
      "speak": "Puer est sub arbore – The boy is under the tree.",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:08–00:09",
      "speak": "Faith phrase: Cum Deō ambulāmus – We walk with God. Even when we move, we move within His peace.",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:09–00:10",
      "speak": "Virtue reflection: Peace is not stillness without purpose — it’s resting where God places you.",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:10–00:11",
      "speak": "Quick chant review: –ā, –ō — rest and peace! Motion gone, quiet release!",
      "pause_for_response": false
    },
    {
      "time_estimate": "00:11–00:12",
      "speak": "Optime! Tomorrow we’ll build full sentences that show rest and relationship.",
      "pause_for_response": false
    }
  ]
}