{
  "day": 3,
  "title": "Integration – Sentence Patterns C & D (Linking and Giving)",
  "estimated_duration": "12–15 minutes",
  "goals": [
    "Identify and translate Sentence Pattern C (Linking) and D (Indirect Object)",
    "Recognize forms of est as linking verbs",
    "Understand dative endings (-ae, -ō) showing the receiver of the action",
    "Review all four sentence patterns A–D"
  ],
  "steps": [
    {
      "time_estimate": "00:00–00:01",
      "speak": "Salve! Welcome to Week 13 Day 3. Today we learn the last two sentence patterns: linking and giving.",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:01–00:02",
      "speak": "First, Pattern C: the linking verb. It joins a subject and an adjective. Example: Deus est bonus – God is good.",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:02–00:03",
      "speak": "Say it together: Deus est bonus. Which word is the linking verb?",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:03–00:04",
      "speak": "Right—est means ‘is’. It links the subject and what is true about it.",
      "pause_for_response": false
    },
    {
      "time_estimate": "00:04–00:05",
      "speak": "Now Pattern D: giving. Example: Dominus servō donum dat – The lord gives a gift to the servant.",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:05–00:06",
      "speak": "The word servō ends in –ō. That shows the dative case—the receiver of the action.",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:06–00:07",
      "speak": "Try: Puella puerō aquam dat – The girl gives water to the boy.",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:07–00:08",
      "speak": "Excellent! Let’s chant all four patterns: A – Puella amat, B – Puella rosam amat, C – Deus est bonus, D – Dominus servō donum dat.",
      "pause_for_response": false
    },
    {
      "time_estimate": "00:08–00:10",
      "speak": "Mini quiz: Which patterns have direct objects? Which has a linking verb? Which has an indirect object?",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:10–00:11",
      "speak": "Correct! B and D have direct objects, D adds an indirect one, and C has the linking verb est.",
      "pause_for_response": false
    },
    {
      "time_estimate": "00:11–00:12",
      "speak": "Faith phrase: Verbum Dei verum est – The Word of God is true. Each sentence we form should tell something true.",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:12–00:13",
      "speak": "Virtue reflection – Truth joins words rightly, just as est joins ideas rightly. God’s truth links all things.",
      "pause_for_response": true
    },
    {
      "time_estimate": "00:13–00:14",
      "speak": "Optime! Tomorrow we’ll review and celebrate mastery of all patterns A through D.",
      "pause_for_response": false
    }
  ]
}