{
  "metadata": {
    "week": 1,
    "day": 1,
    "title": "Week 1 Day 1: Introduction to Latin Alphabet and Pronunciation",
    "duration_minutes": 45,
    "virtue": "Discipline",
    "faith_phrase": "In principio - In the beginning"
  },
  "prior_knowledge_digest": "Students are expected to have a basic understanding of the concept of alphabets and pronunciation from their native language. Familiarity with the idea of classroom objects and greetings in any language will be beneficial. This lesson will introduce the Latin alphabet and its pronunciation, setting the foundation for further vocabulary and grammar acquisition.",
  "yesterday_recap": "N/A - This is the first lesson of the course.",
  "spiral_links": {
    "recycled_vocab": [],
    "recycled_grammar": [],
    "prior_day_concepts": [],
    "prior_weeks": []
  },
  "misconception_watchlist": [
    "Confusing Latin pronunciation with English pronunciation",
    "Misidentifying Latin letters with similar-looking English letters"
  ],
  "objectives": {
    "primary": [
      "Students will recite the Latin alphabet with correct pronunciation.",
      "Students will identify and pronounce basic Latin vocabulary related to classroom objects.",
      "Students will understand the virtue of discipline in the context of language learning.",
      "Students will translate the faith phrase 'In principio' and discuss its significance.",
      "Students will demonstrate the ability to connect Latin sounds to written letters."
    ],
    "spiral_review": []
  },
  "materials": [
    "Latin alphabet chart",
    "Flashcards with vocabulary words",
    "Audio recordings of Latin pronunciation",
    "Whiteboard and markers"
  ],
  "lesson_flow": [
    {
      "type": "greeting",
      "duration_minutes": 5,
      "description": "Welcome students and introduce the day's objectives. Discuss the virtue of discipline.",
      "student_action": "Students listen and engage in a brief discussion about discipline.",
      "teacher_notes": "Set a positive tone for the class and emphasize the importance of discipline in learning."
    },
    {
      "type": "introduction",
      "duration_minutes": 10,
      "description": "Introduce the Latin alphabet and its pronunciation using a chart.",
      "student_action": "Students observe the chart and listen to the pronunciation.",
      "teacher_notes": "Model the pronunciation clearly and slowly, highlighting differences from English."
    },
    {
      "type": "chant",
      "duration_minutes": 5,
      "description": "Lead the class in an Alphabet Chant to reinforce pronunciation.",
      "student_action": "Students participate in chanting the alphabet.",
      "teacher_notes": "Encourage participation and correct any mispronunciations gently."
    },
    {
      "type": "guided_practice",
      "duration_minutes": 10,
      "description": "Practice pronunciation of basic vocabulary related to classroom objects.",
      "student_action": "Students repeat vocabulary words after the teacher.",
      "teacher_notes": "Use flashcards and audio recordings to support learning."
    },
    {
      "type": "faith_reflection",
      "duration_minutes": 5,
      "description": "Discuss the faith phrase 'In principio' and its significance.",
      "student_action": "Students reflect on the phrase and share thoughts.",
      "teacher_notes": "Connect the phrase to the concept of beginnings and learning."
    },
    {
      "type": "closure",
      "duration_minutes": 5,
      "description": "Review the day's learning and preview the next lesson.",
      "student_action": "Students ask questions and provide feedback.",
      "teacher_notes": "Reinforce key points and encourage students to practice at home."
    }
  ],
  "behavior": {
    "tone": "Encouraging and supportive",
    "loop_behavior": "Reiterate key points if students seem confused",
    "hints_max": 3,
    "wait_seconds": 5,
    "encouragement_frequency": "Frequent"
  }
}
